In [37]:
data = {
'Name': ['Alice', 'Bob', 'Charlie', None, 'Eve'],
'Age': [24, None, 22, 32, 29],
'City': ['New York', 'Los Angeles', None, 'Houston', 'Phoenix'],
'Salary': [70000, 80000, None, 120000, None]}
print(data)

{'Name': ['Alice', 'Bob', 'Charlie', None, 'Eve'], 'Age': [24, None, 22, 32, 29], 'City': ['New York', 'Los Angeles', None, 'Houston', 'Phoenix'], 'Salary': [70000, 80000, None, 120000, None]}

In [39]:
import pandas as pd

In [41]:
df = pd.DataFrame(data)
display(df)

      Name   Age         City    Salary
0    Alice  24.0     New York   70000.0
1      Bob   NaN  Los Angeles   80000.0
2  Charlie  22.0         None       NaN
3     None  32.0      Houston  120000.0
4      Eve  29.0      Phoenix       NaN

In [43]:
# Count missing values in each column
missing_values = df.isnull().sum()

print(missing_values)

Name      1
Age       1
City      1
Salary    2
dtype: int64

In [29]:
# Calculate the average salary, skipping missing values
average_salary = df['Salary'].mean()

# Create a new column 'Salary_Filled' with missing values filled with the average salary
df['Salary_Filled'] = df['Salary'].fillna(average_salary)

display(df)

      Name   Age         City    Salary  Salary_Filled
0    Alice  24.0     New York   70000.0        70000.0
1      Bob   NaN  Los Angeles   80000.0        80000.0
2  Charlie  22.0         None       NaN        90000.0
3     None  32.0      Houston  120000.0       120000.0
4      Eve  29.0      Phoenix       NaN        90000.0